Repository: nemuTUI/nemu
Catalog: lang/*/nemu.po
Languages: ru

source: Enable sharing
ru: Разрешить совместное использование

source: Path to directory
ru: Путь до директории

source: Name of the share
ru: Имя ресурса

source: Drive interface
ru: Интерфейс диска

source: Disk image format
ru: Формат образа диска

source: Discard mode
ru: Сбросить настройки

source: Size [1-
ru: Размер [1-

source: Incorrect drive size, press any key
ru: Неправильный размер диска, нажмите любую кнопку

source: %s: cannot create image file
ru: %s: не могу создать файл диска

source: No additional disks, press any key
ru: Нет дополнительных дисков, нажмите любую кнопку

source: Cannot delete drive from filesystem, press any key
ru: Не смог удалить диск из файловой системы, нажмите любую кнопку

source: Name
ru: Имя

source: Architecture
ru: Архитектура

source: CPU count
ru: Количество ядер CPU

source: Memory [4-
ru: Память [4-

source: Disk [1-
ru: Диск [1-

source: Disk interface
ru: Интерфейс дисков

source: Path to disk image
ru: Путь до образа диска

source: Path to ISO/IMG
ru: Путь до ISO/IMG

source: Network interfaces
ru: Сетевые интерфейсы

source: Net driver
ru: Сетевой драйвер

source: %s: cannot create thread
ru: %s: ошибка создания потока

source: %s: cannot join thread
ru: %s: не могу присоединить поток

source: CPU cores
ru: CPU ядра

source: Memory
ru: Память

source: Disk
ru: Диск

source: No space left for importing drive image, press any key
ru: Не осталось места для образа импортируемого устройства, нажмите любую кнопку

source: %s: cannot convert image file
ru: %s: не вышло сконвертировать файл образа

source: %s: cannot create VM directory %s: %s
ru: %s: не могу создать директорию ВМ %s: %s

source: Error get home directory: %s
ru: Не смог узнать домашнюю директорию: %s

source: cfg: no write access to %s
ru: cfg: нет прав на чтение для %s

source: cfg: %s is not a directory
ru: cfg: %s это не директория

source: cfg: no read + exec access to %s
ru: cfg: нет доступа на чтение и исполнение для %s

source: cfg: incorrect color value %s, example:5fafff
ru: cfg: неправильное значение цвета %s, пример: 5fafff

source: cfg: incorrect color value %s, example:cd1430
ru: cfg: неправильное значение цвета %s, пример: cd1430

source: cfg: incorrect cursor style value %s, example:1
ru: cfg: неправильное значение стиля курсора %s, пример:1

source: cfg: incorrect cursor style value %d
ru: cfg: неправильное значение стиля курсора %d

source: cfg: incorrect D-Bus timeout value %ld
ru: cfg: неправильное значение времени ожидания D-Bus %ld

source: Config file "%s" is not found.
ru: Конфигурационный файл "%s" не найден.

source: You can copy example from:
ru: Вы можете скопировать пример из файла:

source: and edit it manually or let the program generate it.
ru: и отредактировать его вручную, либо программа сгенерирует его сама.

source: Generate cfg? (y/n) >
ru: Сгененировать конфигурационный файл? (y/n) >

source: %s: config filepath "%s" ends with /
ru: %s: у вас / в конце пути конфигурационного файла "%s"

source: VM storage directory
ru: Директория для хранения виртуальных машин

source: Cannot create VM storage directory %s: %s
ru: Не смог создать директорию для хранения данных виртуальной машины %s: %s

source: Try again? (y/n) >
ru: Попробовать снова? (y/n) >

source: VM settings database path
ru: Путь до файла с базой настроек виртуальных машин

source: %s: database filepath "%s" ends with /
ru: %s: у вас / в конце пути базы данных "%s"

source: VNC client arguments
ru: Аргументы VNC клиента

source: SPICE client arguments
ru: Аргументы клиента SPICE

source: Path to directory, where QEMU binary can be found
ru: Путь до директории, в которой я смог бы найти бинарный файл QEMU

source: QEMU system targets list, separated by comma
ru: Список установленных целей QEMU, разделенных запятой

source: %s [default: %s] >
ru: %s [по умолчанию: %s] >

source: Error get user input data
ru: Не смог получить пользовательский ввод

source: cfg error: %s->%s is missing
ru: cfg ошибка: %s->%s отсутствует

source: cfg error: %s->%s is empty
ru: cfg ошибка: %s->%s пустой

source: %s: database error: %s
ru: %s: ошибка базы данных: %s

source: %s: database already in transaction
ru: %s: база данных уже в процессе транзакции

source: Database version is not up do date. I will try to update it.
ru: Версия базы данных не актуальна. Я попробую её обновить.

source: Cannot update database
ru: Не могу обновить базу данных

source: OS Installed
ru: ОС Установлена

source: Path to BIOS
ru: Путь до BIOS

source: Path to flash
ru: Путь до flash

source: Path to kernel
ru: Путь до ядра

source: Kernel cmdline
ru: Аргументы ядра

source: Path to initrd
ru: Путь до initrd

source: GDB debug port
ru: Порт отладки GDB

source: Freeze after start
ru: Приостановить после запуска

source: ISO/IMG path not set, press any key
ru: Путь ISO/IMG не установлен, нажмите любую клавишу

source: Interface name
ru: Имя интерфейса

source: Mac address
ru: Мак адрес

source: IPv4 address
ru: IPv4 адрес

source: User mode
ru: Режим пользователя

source: Port forwarding
ru: Пересылка порта

source: Share folder
ru: Поделиться диреткорией

source: Confirm deletion? (y/n)
ru: Продолжить удаление? (y/n)

source: Invalid mac address, press any key
ru: Неправльный mac адрес, нажмите любую кнопку

source: This mac address is already used, press any key
ru: Это мак адрес уже задействован, нажмите любую кнопку

source: This interface name is already used, press any key
ru: Это имя интерфейса уже занято, нажмите любую кнопку

source: Invalid portfwd value, format: tcp|udp::[1-65535]-:[1-65535], press any key
ru: Неправильное значение portfwd, формат: tcp|udp::[1-65535]-:[1-65535], нажмите любую кнопку

source: Host CPU [yes/no]
ru: Хост-процессор [yes/no]

source: USB version
ru: Версия USB

source: Machine type
ru: Тип машины

source: Extra QEMU args
ru: Дополнительные аргументы QEMU

source: Group
ru: Группа

source: Edit properties
ru: Править характеристики

source: Host CPU
ru: Хост-процессор

source: Host CPU requires KVM enabled, press any key
ru: Хост-процессор требует включить KVM, нажмите любую кнопку

source: Window size to small, press any key
ru: Размер окна слишком мал, нажмите любую кнопку

source: Contents of field is invalid, press any key
ru: Содержимое полей неприемлемо, нажмите любую кнопку

source: Window too small
ru: Окно маловато

source: These fields cannot be empty:
ru: Эти поля не могут быть пустыми:

source: This name is already used, press any key
ru: Это имя уже задействовано, нажмите любую кнопку

source: Bad INI file: missing "]" at section name
ru: Плохой INI файл: отсутствует "]" в имени секции

source: NULL list head pointer
ru: Пустой указатель на заголовок списка

source: Cannot get mach for %-6s . Error was logged
ru: Не могу поять тип виртуальной машины %-6s . Ошибка внесена в журнал ошибок (логи)

source: -s, --start <name> start vm
ru: -s, --start <name> включить виртуальную машину

source: -f, --force-stop <name> shutdown vm
ru: -f, --force-stop <name> принудительное выключение виртуальной машины

source: -z, --reset <name> reset vm
ru: -z, --reset <name> перезапустить виртуальную машину

source: -i, --info <name> print vm info
ru: -i, --info <name> показать информацию о виртуальной машине

source: -m, --cmd <name> print vm command line
ru: -m, --cmd <name> показать набор команд

source: -C, --cfg <path> path to config file
ru: -C, --cfg <path> путь до файла конфигурации

source: -l, --list list vms
ru: -l, --list список виртуальных машин

source: -d, --daemon vm monitoring daemon
ru: -d, --daemon демон мониторинга виртуальных машин

source: -v, --version show version
ru: -v, --version текущая версия

source: -h, --help show help
ru: -h, --help помощь

source: create snapshot
ru: создать снепшот

source: load snapshot
ru: загрузить снепшот

source: delete snapshot
ru: удалить снепшот

source: show snapshots
ru: показать снепшоты

source: snapshot name is not set (--name)
ru: имя снепшота не задано (--name)

source: Group does not exists, press any key
ru: Группа не существует, нажмите любую кнопку

source: Start daemon: nemu --daemon, press any key
ru: Запуск демона: nemu --daemon, нажмите любую кнопку

source: Only qcow2 format is supported, press any key
ru: Поддерживается только формат qcow2, нажмите любую кнопку

source: %s: invalid index: %zu
ru: %s: некорректный индекс: %zu

source: Invalid address format: expected IPv4/CIDR
ru: Неправильный формат адреса: я ожидал IPv4/CIDR

source: Invalid IPv4 address
ru: Неверный IPv4 адрес

source: Invalid CIDR: expected [1-32]
ru: Неверный CIDR: я ожидал [1-32]

source: Path to OVA
ru: Путь до OVA

source: Name (optional)
ru: Имя (опционально)

source: OVF version
ru: Версия OVF

source: %s: error
ru: %s: ошибка

source: OVF file is not found, press any key
ru: Файл OVF не найден, нажмите любую кнопку

source: Cannot parse OVF file, press any key
ru: Не могу разобрать OVF file, нажмите любую кнопку

source: Cannot create new XPath context, press any key
ru: Не смог создать новый контекст XPath, нажмите любую кнопку

source: , press any key
ru: , нажмите любую кнопу

source: Some files was not deleted!, press any key
ru: Некоторые файлы не были удалены, нажмите любую кнопку

source: Incorrect OVF version, press any key
ru: Неправильная версия OVF, нажмите любую кнопку

source: QMP: cannot set socket options, press any key
ru: QMP: не могу установить опции сокета, нажмите любую кнопку

source: QMP: cannot connect to socket, press any key
ru: QMP: не могу связаться с сокетом, нажмите любую кнопку

source: Error send message to QMP socket, press any key
ru: Ошибка отправки сообщения на сокет QMP, нажмите любую кнопку

source: QMP: no answer, press any key
ru: QMP: он со мной не разговаривает, нажмите любую кнопку

source: QMP: execute error, press any key
ru: QMP: ошибка исполнения, нажмите любую кнопку

source: New VM name
ru: Новое имя виртуальной машины

source: Rename VM
ru: Переименовать виртуальную машину

source: %s: path "%s" already exists
ru: %s: путь "%s" уже существует

source: %s: bad length
ru: %s: некорректная длина

source: %s: integer overflow
ru: %s: слишком большое целочисленное

source: %s: zero length string
ru: %s: строка нулевой длины

source: %s: invalid length: %d
ru: %s: некорректная длина: %d

source: %s: string replace failed
ru: %s: ошибка замены строк

source: Integer overflow
ru: Слишком большое целочисленное

source: Integer overflow
ru: Слишком большое целочисленное

source: Malformed nm_str_t data
ru: Неправильно введенные данные nm_str_t

source: %s: udev_hwdb_new failed
ru: %s: udev_hwdb_new не смогла

source: %s: libusb_get_device_list failed
ru: %s: libusb_get_device_list не смогла

source: Device
ru: Устройство

source: USB must be enabled at boot time, press any key
ru: USB должен быть доступен во время загрузки, нажмите любую кнопку

source: There are no usb devices, press any key
ru: Нет USB устройств, нажмите любую кнопку

source: There are no devices attached, press any key
ru: Нет вставленных устройств, нажмите любую кнопку

source: Empty device name, press any key
ru: Пустое имя устройства, нажмите любую кнопку

source: Malformed input data, press any key
ru: Неправильно введенные данные, нажмите любую кнопку

source: Already attached, press any key
ru: Уже запущено, нажмите любую кнопку

source: Cannot open file %s:%s
ru: Не могу открыть файл %s:%s

source: Cannot get file info %s:%s
ru: Не могу узнать информацию о файле %s:%s

source: %s: cannot map file %s:%s
ru: %s: не могу отобразить файл в память %s:%s

source: %s: path "%s" too long
ru: %s: путь "%s" слишком длинный

source: %s: bad format: %%%c
ru: %s: неверно задан формат: %%%c

source: %s: NULL vector pointer value
ru: %s: нулевой указатель на вектор

source: %s: invalid index
ru: %s: некорректный индекс

source: Spice server
ru: Сервер SPICE

source: VNC/Spice port
ru: Порт VNC/SPICE

source: Serial TTY
ru: Перенаправление серийного порта TTY

source: Serial socket
ru: Перенаправление серийного сокета

source: Sync mouse position
ru: Синхронизировать курсор

source: Display type
ru: Тип дисплея

source: Already installed (y/n)
ru: Уже установлен (y/n)

source: Start failed, error was logged, press any key
ru: Не смогла запустить, ошибку внесла в журнал, нажмите любую кнопку

source: ISO path does not exist, press any key
ru: Путь ISO не существует, нажмите любую клавишу

source: Socket is already used!, press any key
ru: Сокет уже задействован, нажмите любую кнопку

source: TTY is missing!, press any key
ru: Не доступна TTY, нажмите любую кнопку

source: TTY is not terminal!, press any key
ru: TTY не найден, нажмите любую кнопку

source: %s: cannot open file %s:%s
ru: %s: не могу открыть файл %s:%s

source: Unused ifaces deleted, press any key
ru: Неиспользованные интерфейсы удалены, нажмите любую кнопку

source: No unused ifaces, press any key
ru: Нет используемых интерфейсов, нажмите любую кнопку

source: %s viewer: port is not set
ru: %s сервис отображения виртуальной машины: не задан порт

source: Snapshot name
ru: Имя снепшота

source: Load at next boot
ru: Загрузка при следующем запуске

source: Snapshot
ru: Снепшот

source: nEMU daemon is not running
ru: nEMU демон не запущен

source: Snapshots are only available for the qcow2 format
ru: Снепшоты доступны только для формата qcow2

source: VM must be running
ru: ВМ должна быть запущена

source: '%s' is already used
ru: '%s' уже используется

source: '%s' no such snapshot
ru: '%s' снапшот не найден

source: This name is already used, delete it first, press any key
ru: Это имя уже задействовано, сначала удалите его, нажмите любую кнопку

source: VM list
ru: Список виртуальных машин

source: veth list
ru: список интерфейсов veth

source: Iface list
ru: Список интерфейсов

source: Properties
ru: Характеристики

source: window to small
ru: уменьшить окно
